<template>
	<view class="container">
		<view class="title">前部及导言</view>
		<view>
			<view class="first-title"></view>
			<view class="text">
				本APP的所有权和运作权归所有。在本服务条款中简称
				“本公司”及有时称为“我们”。“用户”或“您”是指通过本公司提供的获取软件授权和号码注册的途径获得软件产品及号码授权许可的个人或单一实体。本《协议》描述本公司与您之间关于本APP的可使用及相关方面的权利和责任。使用本服务将视为您同意以下使用条款。
			</view>
		</view>

		<view>
			<view>
				<view class="first-title mt">1、知识产权</view>
				<view class="text">
					(a)
					本软件由开发。软件的商标、版权等一切知识产权，以及与软件相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、或电子文档等均受著作权法和国际著作权条约以及其他知识产权法律法规的保护。
				</view>
			</view>
			<view>
				<view class="first-title">2、用户隐私制度</view>
				<view class="text mt">
					(a) 尊重用户个人隐私是本公司的一项基本政策。所以，本公司一般不会公开、编辑或透露用户的资料或保存在本公司服务中的非公开内容，除非本公司在诚信的基础上认为透露这些信息在以下几种情况是必要的：
				</view>
				<view class="text mt">
					(b) 遵守有关法律规定，包括在国家有关机关查询时，提供用户通过本服务发布的信息内容及其发布时间、互联网地址或者域名。
				</view>
				<view class="text mt">
					遵从本服务的服务程序。
				</view>
				<view class="text mt">
					保持维护本公司的商标等知识产权。
				</view>
				<view class="text mt">
					在紧急情下竭况力维护用户个人和社会大众的隐私安全。
				</view>
				<view class="text mt">
					本公司认为必要的其他情况下。
				</view>
				<view class="text mt">
					要了解本服务数据保护措施的具体信息，请阅读本服务的隐私权政策，请点击本软件隐私协议
					。该政策解释了当您使用本服务时，本服务会如何处理您的个人信息，以及如何保护您的隐私权。您同意会在遵守本服务隐私权政策的前提下应用自己的数据。
				</view>
			</view>
			<view>
				<view class="first-title mt">3、用户禁止行为</view>
				<view class="text mt">
					(a) 用户应在遵守法律及本协议的前提下依本《协议》约定使用本软件。用户不得实施包括但不限于下列行为：
				</view>
				<view class="text mt">
					(b) 用户同意不会修改、改编、翻译本服务、创作本服务的派生作品、通过反编译、反向工程、反汇编或其它方式从本服务得到源代码。
				</view>
				<view class="text mt">
					(c) 用户同意不会删除、掩盖或更改本公司或任何第三方的版权声明、商标或其它所有权声明。
				</view>
				<view class="text mt">
					(d) 利用本APP发表、传送、传播、储存侵害他人知识产权、商业秘密权等合法权利的内容。
				</view>
				<view class="text mt">
					(e) 利用本APP发表、传送、传播、储存违反国家法律、危害国家安全、祖国统一、社会稳定的内容，或任何不当的、侮辱诽谤的、淫秽的、暴力的及任何违反国家法律法规政策的内容。
				</view>
				<view class="text mt">
					(f) 对于本APP相关信息等，擅自使用、复制、修改、链接、转载、汇编、发表、出版，建立镜像站点、擅自借助软件发展与之有关的衍生产品、作品、服务等。
				</view>
				<view class="text mt">
					(g) 利用本APP进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器/账户；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试本软件系统或网络的弱点或其它实施破坏网络安全的行为；
					企图干涉、破坏本软件系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造IP数据包；未经许可利用本软件进行虚拟货币采集和交易活动。
				</view>
			</view>
			<view>
				<view class="first-title mt">4、服务变更</view>
				<view class="text mt">
					(a) 本APP保留在任何时候通过为您提供本软件替换、修改、升级版本的权利以及为替换、修改或升级收取费用的权利。
				</view>
			</view>
			<view>
				<view class="first-title mt">5、责任限制</view>
				<view class="text mt">
					(a)
					用户理解并同意自主选择下载和使用本服务和所有与本服务一同提供或通过本服务提供的第三方软件，风险自负，并且对于因下载或使用本服务和此类第三方软件而对计算机系统造成的损坏或数据的丢失，用户应承担全部责任。在适用法律允许的最大范围内，本公司明确表示不提供任何其他类型的保证，不论使明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。
				</view>
				<view class="text mt">
					在适用法律允许的最大范围内，本公司及其许可人不会向您做出以下声明或担保：
				</view>
				<view class="text mt">
					（1）您对服务的使用会满足您的需求；
				</view>
				<view class="text mt">
					（2）您对服务的使用会连续无中断、及时、安全或没有错误；
				</view>
				<view class="text mt">
					（3）您使用相关服务而获得的任何信息一律准确可靠；
				</view>
				<view class="text mt">
					（4）作为相关服务的一部分向您提供的任何软件所发生的操作或功能瑕疵将获得修正。
				</view>
				<view class="text mt">
					在适用法律允许的最大范围内，本公司不就因用户使用本服务引起的，或在任何方面与本公司的产品和服务有关的任何意外的、非直接的、特殊的、或间接的损害或请求（包括但不限于因人身伤害、因隐私泄漏、因未能履行包括诚信或合理谨慎在内的任何责任、因过失和因任何其他金钱上的损失或其他损失而造成的损害赔偿）承担任何责任。用户上载的行为，即意味着用户或用户代理的著作权人授权本公司及其关联公司在本服务的服务器上保存内容，但用户或原著作权人仍保有上载作品的著作权，且本公司未经用户或原著作权人许可不得将上载作品在其他公开渠道发布。如用户在使用本服务时涉及到其他本公司或其关联公司提供的服务，还应遵守相应的服务条款。
				</view>
			</view>
			<view>
				<view class="first-title mt">6、保障</view>
				<view class="text mt">
					(a)
					使用本APP必须遵守国家有关法律和政策等，维护国家利益，保护国家安全，并遵守本协议，对于用户违法或违反本协议的使用而引起的一切责任，由用户负全部责任，一概与本公司及合作单位无关，导致本公司及合作单位损失的，本公司及合作单位有权要求用户赔偿，并有权立即停止向其提供服务，保留相关记录，保留配合司法机关追究法律责任的权利。
				</view>
			</view>
			<view>
				<view class="first-title mt">7、法律与免责</view>
				<view class="text mt">
					(a)
					使用本APP涉及到互联网服务，可能会受到各个环节不稳定因素的影响，存在因不可抗力、计算机病毒、黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足用户要求的风险，用户须明白并自行承担以上风险，本公司及合作单位不承担任何责任。
				</view>
				<view class="text mt">
					(b) 用户因第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而遭受的经济损失，本公司及合作单位不承担责任。
				</view>
			</view>
			<view>
				<view class="first-title mt">8、法律适用及争议解决</view>
				<view class="text mt">
					(a) 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国的法律。本协议签订地为长沙市岳麓区，若您和我们之间发生纠纷或争议，首先应友好解决；协商不成的，您同意将纠纷或争议提交本协议签订地的人民法院管辖。
				</view>
			</view>
		</view>
	</view>
</template>

<script setup>

</script>

<style scoped>
	.container {
		padding: 40rpx;
	}

	.title {
		font-family: PingFang SC, PingFang SC;
		font-weight: 600;
		font-size: 48rpx;
		color: #2B80FF;
	}

	.first-title {
		font-family: PingFang SC, PingFang SC;
		font-weight: 600;
		font-size: 32rpx;
		color: #181B39;
		margin-top: 48rpx;
	}

	.text {
		font-family: PingFang SC, PingFang SC;
		font-weight: 400;
		font-size: 30rpx;
		color: #3A4150;
	}

	.mt {
		margin-bottom: 30rpx;
	}
</style>